music_proj/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "test@test.com"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2023-02-21 21:13:52.749333"], ["updated_at", "2023-02-21 21:13:52.749333"]]
---
    def create
        @user = User.new(params[user_params])
        if @user.save